HELLO_USER = "Привіт, щоб активувати реферльну систему та БЕЗКОШТОВНО отримати софт, натисна на /start"
OPEN_CHANNEL = "Переходь в канал за софтом"
NEW_USER_INVITE = ("Новий користувач приєднався за вашим посиланням! Записуємо +1\n"
                   "До ключа для софту залишилось {0} ")
NEW_USER_INVITE_ADMIN = "Користувач {0} запросив {1} до каналу, йому залишилося {2} інвайтів до отримання ключа підписки"
NEW_USER_JOIN = "Користувач {0} Запустив бота"
USER_HAS_KEY = ("Вітаю! Ти запросив 5 користувачів. "
                "\nCсь твій ключ для активації софта на 2 тижні (НЕ ПЕРЕДАВАЙ ЦЕЙ КЛЮЧ НІКОМУ), а також збережи його десь бо в боті він не зберігається\n\n"
                "{0}")
USER_HAS_KEY_ADMIN = "Користувач {0} отримав ключ запросивши 5 користувачів"
USER_HAS_KEY_ERROR = "Не вийшло згенерувати ключ для ({0}), напишіть у підтримку @manager_korysni_kopalyny"

MENU_USER = ("<b>Ваше реферальне посилання:</b> \n"
             "<code>{0}</code>\n\n"
             "Користувачів всього запрошено: <b>{1}</b>\n\n"
             "Вам залишилося запросити всього <b>{2}</b> користувачів щоб отримати доступ до Супер Софта на тиждень!!!\n\n")

MENU_ADMIN = "Головне меню"
BACK = "Назад"

