HELLO_USER = ("Вітаю, ти успішно зареєстрований.\n\n"
              "<b>😁 Наша реферальна система:</b>\n"
              "Тобі необхідно 📨 запросити 5 друзів по своєму реферальному посиланню (/start щоб отримати його), після цього бот атоматично генерує"
              "тобі ліцензійний ключ по кому ти активуєш підписку на тиждень повністю БЕЗКОШТОВНО!✅"
              "\n\n⚠️Підписка починає дію з моменту активації, тому не парся)\n\n ⚠️Коли реферал приєднується за твоїм "
              "посиланням ти отримуєш про це повідомлення, запросити одного реферала два рази не вийде, тому абузити немає сенсу)")
OPEN_CHANNEL = "Переходь в канал за софтом"
NEW_USER_INVITE = ("Новий користувач приєднався📨 за вашим посиланням! \n\n<b>Записуємо +1</b> "
                   "До ключа для софту залишилось <b>{0}</b> ")
NEW_USER_INVITE_ADMIN = "Користувач @{0} запросив @{1} до каналу, йому залишилося {2} інвайтів до отримання ключа підписки"
NEW_USER_JOIN = "Користувач {0} Запустив бота"
USER_HAS_KEY = ("<b>Вітаю! Ти запросив 5 користувачів 👌</b> "
                "\nОсь твій ключ для активації софта на <b>{0}</b> днів (НЕ ПЕРЕДАВАЙ ЦЕЙ КЛЮЧ НІКОМУ), а також збережи його десь бо в боті він не зберігається\n\n"
                "<code>{1}</code>")

ADMIN_GENRETED_KEY = "Ключ успішно згенеровано на <b>{0}</b> днів: \n\n<code>{1}</code>"
USER_HAS_KEY_ADMIN = "Користувач @{0} отримав ключ 📨 запросивши 5 користувачів"
USER_HAS_KEY_ERROR = "Не вийшло згенерувати ключ для ({0}), перешліть у підтримку @manager_korysni_kopalyny це повідомлення"

MENU_USER = ("<b>Ваше реферальне посилання:</b> \n"
             "<code>{0}</code>\n\n"
             "📨 Користувачів всього запрошено: <b>{1}</b>\n\n"
             "Вам залишилося запросити всього <b>{2}</b> користувачів щоб отримати доступ до Супер Софта на тиждень!!!")

MENU_ADMIN = "Головне меню"
BACK = "Назад"
